{"QueriesAboutIITMandi": 
  [
    {"tag": "branch",
    "patterns": ["My JEE Advanced score is", "my score in jee adv is" ,"My jee advanced score is",
    "My jee adv rank is","My jee advanced rank is","My JEE Advanced rank is", "What branch can I get?", 
    "What branch is available?", "branch possible to get?", "branch that I can get", "branch that i can get",
    "What are the opening and closing ranks for",
    "branch possible for my jee adv rank", "branch possible for my JEE Advanced rank",
     "What is the cut-off for","what is the cutoff for", "what is the cut off rank for", "what is the cut-off rank for"],
    "responses": ["For all questions regarding seat allocation and cut-off ranks and scores, please visit josaa.nic.in to find out about past year's trends with respect to cut-offs.",
    "There is no exact answer to that but you can find out more about the opening and closing ranks for each branch on josaa.nic.in",
    "Due to varying trends in cut-off scores and ranks, there is no exact answer available at the moment. You may visit josaa.nic.in to find last year's cut-off rank and score related data."],
    "context": [""]},
 
     {"tag":"location",    
    "patterns":["Is IIT Mandi difficult to reach","to reach IIT Mandi","route to IIT Mandi","best way to reach IIT Mandi", 
      "reaching IIT Mandi", "reaching IIT Mandi from","Is campus difficult to reach","to reach campus","route to campus","best way to reach campus", 
      "reaching campus from","reaching campus","Is the campus difficult to reach","to reach the campus","route to the campus","best way to reach the campus", 
      "reaching the campus", "reaching the campus from","Is iit mandi campus difficult to reach","to reach iit mandi campus","route to iit mandi campus",
      "best way to reach iit mandi campus", "reaching iit mandi campus", "reaching iit mandi campus from","Is college campus difficult to reach","to reach college campus","route to college campus","best way to reach college campus", 
      "reaching college campus", "reaching college campus from"],
    "responses":["Your only concern should be to reach Chandigarh first. After that reaching Mandi is easy and from Mandi town, the institute bus can handle your journey to the campus. Find out more at: https://www.iitmandi.ac.in/institute/campus/how_to_reach.php",
      "Once you reach Mandi, via Delhi or Chandigarh, your journey will be simplified by the institute bus that takes you from Mandi to the campus. Find out more at: https://www.iitmandi.ac.in/institute/campus/how_to_reach.php",
      "You only need to be worried about reaching Chandigarh or Delhi. After that there are buses and taxis that ply between Mandi and Chandigarh. Once you reach mandi, the institute bus will take you to the campus. For more details, visit: https://www.iitmandi.ac.in/institute/campus/how_to_reach.php"],
    "context":[""]},
  
     {"tag":"safety",
      "patterns":["is the campus safe","safety in the campus","how safe is the campus", "are we safe at the campus","is the campus a safe place",
        "is iit mandi campus safe","safety in iit mandi campus","how safe is iit mandi campus", "are we safe at iit mandi campus","is iit mandi campus a safe place",
        "is Campus safe","safety in Campus","how safe is Campus", "are we safe at Campus","is Campus a safe place",
        "is Institute safe","safety in Institute","how safe is Institute", "are we safe at Institute","is Institute a safe place",
        "is The institute safe","safety in The institute","how safe is The institute", "are we safe at The institute","is The institute a safe place",
        "is The college campus safe","safety in The college campus","how safe is The college campus", "are we safe at The college campus","is The college campus a safe place",
        "is College campus safe","safety in College campus","how safe is College campus", "are we safe at College campus","is College campus a safe place",
        "is Iit mandi safe","safety in Iit mandi","how safe is Iit mandi", "are we safe at Iit mandi","is Iit mandi a safe place",
        "is The campus of iit mandi safe","safety in The campus of iit mandi","how safe is The campus of iit mandi", "are we safe at The campus of iit mandi","is The campus of iit mandi a safe place",
        "is Campus of iit mandi safe","safety in Campus of iit mandi","how safe is Campus of iit mandi", "are we safe at Campus of iit mandi","is Campus of iit mandi a safe place",
        "is The college safe","safety in The college","how safe is The college", "are we safe at The college","is The college a safe place"],
      "responses":["Yes, indeed, IIT Mandi's beautiful campus is safe from natural calamities. You only need a sweater to protect against the cold. Girls too have a safe environment to carry out their educational and co-curricular activities.",
        "IIT Mandi's campus is an extremely safe space for everyone. It is also safe from natural calamities. We do suggest bringing lots of woollen clothing to protect yourself from the freezing cold, though!",
        "IIT Mandi's campus brings to safety from all natural calamities along with all of the scenic beauty. All students have a safe, protected space for the educational and extra-curricular activities here. Don't forget to bring your woollen clothing along, as it can get pretty cold here!"],
      "context":[""]},

    {"tag":"weather",
        "patterns":["weather too cold", "low temperature","too cold at the campus", "safe from cold","protection against cold"],
        "responses":["Yes, indeed, IIT Mandi is a very cold place. During winters, the temperature sometimes reaches sub-zero levels. It is highly necessary that you bring along some woollen wear and sweaters to keep yourself safe. Hot R.O. filtered water is available at all times. Room heaters are provided on a monthly payment basis too.",
      "The temperature at the campus can reach below 0 degrees celsius at times, especially during winters. So, make sure bring along with you the right clothing to the campus. You can also get hot water at all times in R.O.water filters.",
      "The weather can get really cold here. The winters are harsh and we may experience snow fall at times. Please ensure that you bring along with you the necessary woollen clothing and blankets to protect yourself from the cold. Hot water is always available at R.O. water filters."],
        "context":[""]},

    {"tag":"societiesandclubs",
         "patterns":["societies and clubs of iit mandi","club activities","student societies",
            "club activities at iit mandi","student societies at iit mandi","clubs at iit mandi","events organised by clubs at iit mandi"],
         "responses":["IIT Mandi has various student-managed clubs under Technical, Cultural, Sports, Research and Academic Societies. There are independent clubs too. You can find a comprehensive list of the clubs and societies of IIT Mandi at these links: https://wiki.iitmandi.co.in/p/List_of_Societies_and_Clubs and https://gymkhana.iitmandi.co.in/",
            "The students at IIT Mandi organize and conduct contests, competitions and many more events through clubs and socviueties. You can find the entire list of clubs and societies of IIT Mandi at the following links: https://wiki.iitmandi.co.in/p/List_of_Societies_and_Clubs and https://gymkhana.iitmandi.co.in/",
            "Here at IIT Mandi, the various clubs and societies organize contests, competitions and events organized and run by students. The complete list of clubs and various societies of IIT Mandi can be found in the following links: https://wiki.iitmandi.co.in/p/List_of_Societies_and_Clubs and https://gymkhana.iitmandi.co.in/"],
         "context":[""]},

    {"tag":"culturalsociety",
         "patterns":["activities in cultural society", "cultural activities","events organised by cultural club","culturals at iit mandi",
      "clubs in cultutral society"],
         "responses":["The various clubs under the Cultural Society of IIT Mandi welcome open participation from all students and it includes UDC, Photography and Moviemaking Club, Drama Club, Music Club, Designauts and Art geeks. It also conducts the events Kala, Exuberance, Adventure Time and Aakarshan. You may find out more at https://wiki.iitmandi.co.in/p/Cultural_Society",
            "The Cultural Society of IIT Mandi consists of various clubs which welcome open participation from all students. The clubs included are UDC, Photography and Moviemaking Club, Drama Club, Music Club, Designauts and Art geeks. The hallmark events organised by the cultural society include Kala, Exuberance, Adventure Time and Aaakarshan. Find out more at https://wiki.iitmandi.co.in/p/Cultural_Society",
            "There are various open clubs under the Cultural Society of IIT Mandi. They are UDC, Photography and Moviemaking Club, Drama Club, Music Club, Designauts and Art geeks. The CulSoc also organizes the following events: Kala, Exuberance, Adventure Time and Aaakarshan. Find out more at https://wiki.iitmandi.co.in/p/Cultural_Society"],
         "context":[""]},    

    {"tag":"technicalsociety",
         "patterns":["activities in technical society", "technical activities","events organised by technical club","technicals at iit mandi",
            "clubs in cultutral society"],
         "responses":["The Science and Technology Council, SnTC for short is a student body advised by faculty. It is IIT Mandi's Technical Society. You may find out more about it's clubs and activities and student achievements at https://iitmandi.co.in/ and https://gymkhana.iitmandi.co.in/technical.html",
      "IIT Mandi has the Technical Society governed by the Science and Technology Council (or SnTC in short) which is a student body advised by faculty. Visit https://iitmandi.co.in/ and https://gymkhana.iitmandi.co.in/technical.html to find out more about the clubs and activities contained within SnTC and various acheivements by the students of IIT Mandi.",
      "The students of IIT Mandi innovate and experiment within the Technical Society of IIT Mandi, which is governed by the Science and Technology Council or SnTC, a student body advised by faculty. Explore more about it's clubs, activities and achievements at https://iitmandi.co.in/ and https://gymkhana.iitmandi.co.in/technical.html"],
         "context":[""]},    

    {"tag":"sportssociety",
         "patterns":["sports at iit mandi","games at iit mandi","sports activities at iit mandi","sports events at IIT Mandi",
            "sports tournaments at IIT mandi","cricket","badminton","athletics","basketball","chess","hockey","lawn tennis",
            "table tennis","volleyball","weight-lifting"],
         "responses":["The Sports Society of IIT Mandi is run by students led by the Sports Secretary of the Student Gymkhana, alongside various staff members and faculty. It hosts the Freshers’ Sports Meet, Hostel General Championship, Aagaz (Inter-year tournament), and KPL (Kamand Premier League). The students are well-trained by coaches as players and are encouraged to participate in various tournaments nationally and most importantly, the Inter-IIT Sports Meet. It also includes the Hiking and Trekking club and the Mountain Biking Club.",
      "The students of IIT Mandi led by the Sports Secretary of Student Gymkhana run the Sports Society, alongside faculty and staff members. The Sports Society organises the Freshers’ Sports Meet, Hostel General Championship, Aagaz (Inter-year tournament), and KPL (Kamand Premier League). Our well-trained coaches encourage and train the players to participate in various national tournaments, the most significant one being the Inter-IIT Sports Meet. The Hiking and Trekking Club and the MOuntain  Biking Club are included in the Sports Society."],
         "context":[""]},    

    {"tag":"researchsociety",
         "patterns":["activities in research society","activities by research society", "organised by research society","clubs of research society"],
         "responses":["The research society includes within itself SCRI, IEEE, ACM, ACM-W. Find out more in the following links: https://gymkhana.iitmandi.co.in/research.html, https://scri.iitmandi.ac.in/, https://ieee.iitmandi.ac.in/"],
         "context":[""]},
    
    {"tag":"academicsociety",
         "patterns":["activities by academic society","academic society","organised by research society"],
         "responses":["The Academic Society includes the Senate and the UG Academic Council. The Senate is the topmost decision making body of IIT Mandi, pertaining to academic affairs of the Institute. The UG Academic Council is an informal academic body that ensures smooth communication between all students and the Academic Affairs Secretary.",
      "The Senate and the UG Academic Council make up the Academic Society of IIT Mandi. The Senate is the topmost decision making body which makes all the important decisions related to the academic matters of the Institute. The UG Academic Council is an informal academic body that communicates between all students and the Academic Affairs Secretary."],
         "context":[""]},
    
    {"tag":"belowCSEcutoffJEE",
         "patterns":["rank is below cut off for CSE in IITs", "not getting CSE for my rank","rank not sufficient for CSE"],
         "responses":["IITs offer a wholesome academic environment superior to any other engineering institute in India. An IIT B.Tech programme will train you for the fast-changing world of technology and science. With the right amount of dedication, hardwork and passion for problem solving you will be able to excel in any branch in any IIT.",
            "The academic environment in any IIT is wholesome and the B.Tech programme offered at IITs will train you for the fast-paced world of STEM. All you need is passion and drive for problem solving, hardwork and dedication to be able to excel in any branch in any IIT.",
            "All IITs provide a wholesome training to all of its students enrolled in any of the B.Tech programmes. You will be well teined to accomodate to the rapid changes in the field of technology and science. Your passion, hardwork and dedication will enable you to excel in any branch in any IIT."],
         "context":[""]},    
    
    {"tag":"RankListGirls",
         "patterns":["seperate rank list for girls","female-only supernumerary seats"],
         "responses":["There is no seperate rank list for female candidates. Between the female supernumerary pool of seats and the gender-neutral pool of seats, female candidates first compete for the female-only seats and then for the gender-neutral seats. For this, the common rank list is only required. About 20% of the seats are categorised as female-only.",
            "About 20% of the seats at IITs are categorised under female supernumerary. The female candidates first compete for the female-only seats and then for the gender neutral pool. So, there is no seperate rank list for females. The common rank list is used to allocate seats.",
            "The seats at IIT are categorised as female-only (which includes 20% of all seats) and gender neutral. All female candidates first compete for the female-only pool and then for the gender-neutral pool of seats. Due to this, there is no seperate rank list for females."],
         "context":[""]},    
    
    {"tag":"seatAllocationProcedure",
         "patterns":["meaning of freeze, float, slide in JoSAA","freeze in JoSAA seat allocation", "float in JoSAA Seat allocation","slide in JoSAA Seat allocation"],
         "responses":["The seats are allocated in multiple rounds in JoSAA. After being allocated a seat in each round, the candidate may freeze, float, slide or reject the allotted seat. \n\t1)Freeze implies that candidate has accepted given seat and does not wish to participate in further rounds.\n\t2)Float implies that candidate would like to be considered for any branch or any institute on preference list.\n\t3)Slide implies that the candidate wants to be in the current allotted institute but still wants to be considered for preferable branches within that institute.\n\t4)Reject means that she does not want to continue and be considered for any further rounds of counselling."],
         "context":[""]},    
        
    {"tag":"JoSAAFeePaymentDocVerification",
            "patterns":["where do I upload documents for JoSAA","which documents need to be uploaded","uploading documents",
                  "document upload","JoSAA Document verification","JoSAA counselling fee payment","Payment of JoSAA counselling fee"],
            "responses":["Kindly visit http://josaa.nic.in/ for information on document verification and JoSAAA counselling fee payment. For further clarification, contact your Zonal IIT or the organising institute.",
                  "For information on JoSAA counselling fee payment and document verification details, visit http://josaa.nic.in/. You may contact your Zonal IIT or the organising institute for further clarification."],
            "context":[""]},
    
    {"tag":"PREPRank",
          "patterns":["got a PREP rank","what does a PREP rank mean","what is preparatory course"],
          "responses":["The Preparatory Course is a provision of PWD, SC and ST candidates only. In case there are vacancies in your category towards the end of seat allocation, you may be provisionally allotted one of these vacant seats. You will then have to attend the Preparatory Course of one year duration in one of the IITs during 2021-2022. If you pass in all subjects, you will be admitted into the allotted branch/IIT in the 2022-2023 session. Keep in mind that the provisional allotment is made based on your choice list. For more information, visit http://josaa.nic.in.",
      "The Preparatory Course is a provision of PwD, SC and ST candidates only. If there are vacancies in your respective category, one of the vacant seats will be allotted to you provisionally. In such a case, you will have to attend the Preparatory Course, which has a duration of 1 year. After that you will be admitted into the allotted branch/IIT in the next academic session, if you pass in all subjects. The provisional allotment is done basis your choice list. For further clarification, visit http://josaa.nic.in."],
          "context":[""]},
    
    {"tag":"WhyIITMandi",
          "patterns":["why should i join IIT Mandi","advantages of iit mandi","plus points of joining iit mandi","iit mandi and "],
          "responses":["A:Unique curriculum with real-world design-oriented projects every year from 1st year to 4th year. Students work in teams across branches. Even in 1st and 2nd year, students do projects that are normally done only in 3rd and 4th year at other IITs. We have a friendly atmosphere with mingling of faculty and students, here at IIT Mandi. Students have easy access to faculty, Deans and the Director. The faculty participate in sports and other activities and eat in the mess along with students. The institute is indeed, a close knit community. Himachal is the most peaceful State in India. The campus is perfectly safe, especially for girls. Situated in the serene Uhl River Valley far from the pollution and congestion of the cities. With a healthy climate, the institute is warm in summer and cool in winter. We have here, excellent outdoor and indoor sports facilities. Unique extra-curricular activities include the Hiking & Trekking Club, the Mountain Biking Club and social outreach programs working with local school children. Himachal has many scenic spots such as Kullu, Manali, Manikaran hot springs, Dharamsala, where you can go for weekend outings with your friends.",
            "IIT Mandi has a unique curriculum which has real-world, design-oriented projects for all 4 years. Students work in teams across branches and even 1st and 2nd year students get involved woth projects normally done in 3rd and 4th years at other IITs. Being a close-knit community, IIT Mandi has a friendly atmosphere where faculty, Deans, and the Director are easily accessible to all students. The faculty participate in sports and other activities and eat in the mess along with students.Situated in the Uhl River Valley, in the peaceful state of Himachal Pradesh, IIT Mandi has a serene and peaceful atmosphere, far from the noise and pollution of the city. The various sceneic spots around are all places to visit in the weekends and holidays with you friends. Excenllent outdoor and indoor sports facilities are also available here. And the climate is always pleasant."],
          "context":[""]},    
    
    {"tag":"GirlsSpecialIncentive",
     "patterns":["special incentives for girl students", "fees for girls","fee payment for female students",
          "fee payment for girl students","special incentives for female students","fees for females"],
     "responses":["Female students admitted to B.Tech programme at IIT Mandi have a full fee waiver and a Rs 1000 per month stipend, for their first year, irrespective of category and income. This merit scholarship will be continued for all 4 years of B.Tech subject to good performance of candidate indicated by a minimum SGPA criteria of 7.0 for the previous two semesters and no disciplinary action.",
          "Girl students admitted to the 4 year B.Tech programme of IIT Mandi are granted a complete fee waiver and Rs 1000 as stipend every month, for their first year, irrespective of category and income. For the continuation of this merit scholarship through all 4 years of B.Tech, the criteria are that the candidate maintains a minimum SGPA of 7.0 for the previous two semesters and that no disciplinary action was taken.",
          "Irrespective of category and family income, all female students admitted to the 4 year B.Tech programme at IIT Mandi have a total fee waiver and Rs 1000 as stipend every month, for their first year at IIT Mandi. The merit scholarship will be provided for the entire four year duration, basis the following criteria: \n1)The candidate has a minimum SGPA of 7.0 for the previous two semesters\n 2)No disciplinary action was taken."],
     "context":[""]},    
    
    {"tag":"KamandCampus",
     "patterns":["campus at Kamand","freshers are accomodated","are freshers accomodated","freshers accomodation",
         "how is the Kamand campus","facilities at kamand campus","campuses completely constructed"],
     "responses":["Freshers are to be accomodated at the North Campus, Kamand. The Phase 1 construction of South campus has been completed and North campus is to be completed in 2021. North and south campuses are contiguous and interconnected with walkways and roadways. Faculties and students are living on both the campuses. Academic activities are usually conducted in the North campus.",
      "The North Campus in Kamand is where freshers are to be accomodated. The Phase 1 construction of the South campus is complete and the North campus is expected to be complete in 2021. The two campuses are contiguous and interconnected by wallkways and roadways. Both campuses accomodate faculties and students. Academic activities are usually concentrated in the North Campus.",
      "While the Phase 1 construction of South campus has been completed, the North campus is to be completed in 2021. Freshers will be accomodated in the North campus where most of the academic activities take place. Faculty and students are accomodated on both the campuses. The North and South campuses are contiguous and interconnected by walkways and roadways."],
     "context":[""]},    
   
    {"tag":"BranchChange",
     "patterns":["change my branch","branch change criteria","branch change","criteria for branch change"],
     "responses":["The branch change criteria solely depend on your CGPA for first two semesters. Find out more at: http://iitmandi.ac.in/academics/branch_change.php",
      "The sole determinant of branch change is your CGPA in the forst two semesters. For more information, visit: http://iitmandi.ac.in/academics/branch_change.php",
      "A candidate may change his/her branch basis the CGPA they have scored in the first two semesters. You may find out more on these criteria at: http://iitmandi.ac.in/academics/branch_change.php"],
     "context":[""]},
        
    {"tag":"CoursesIn1stYear",
     "patterns":["courses in first year","courses in 1st year","courses for first year","courses for 1st year",
         "curriculum for first year","curriculum in 1st year","curriculum for 1st year","curriculum in first year"],
     "responses":["The courses in 1st year include Electrical Systems around us, Computing and Data Science, Mathematics, Reverse Engineering, Graphics for Design, English, German, Applied Electronics and Engineering Thermodynamics. Find out more at http://www.iitmandi.ac.in/academics/courses.php and http://iitmandi.ac.in/academics/perspective_btech_curriculum.php"],
     "context":[""]},
        
    {"tag":"HostelRoomOccupancy",
     "patterns":["how many people will be accomodated in one hostel room","Number of people in one single room","occupancy in hostel rooms","number of people accomodated per hostel room",
          "accomodated per hostel room","accomodation in one hostel room"],
     "responses":["The Hostel rooms are of single, double and triple occupancy. First year students usually get a shared room.",
          "The hostel rooms can accomodate upto 1 to 3 people. First year students are usually allocated a shared room."],
     "context":[""]},    
        
    {"tag":"FreshersAndLaptops",
     "patterns":["Can freshers bring laptops","freshers allowed to bring laptops","freshers bringing laptops"],
     "responses":["Yes, freshers are allowed to bring laptops","Freshers are allowed to bring laptops in the first semester."],
     "context":[""]},    
        
    {"tag":"LaptopRecommendations",
     "patterns":["what sort of laptop","recommended laptop specifications","laptop specifications recommended",
      "recommended laptop specs","laptop specs recommended","what laptop should i buy"],
     "responses":["While selecting an appropriate laptop, keep in mind its use in your student life, the mobility of your laptop and the budget you have allocated. As of January 2021, it is highly recommended that you have a laptop of 4 to 8 GB RAM and minimum of 256 GB Memory. Specs recommended may change with time and the laptop brand/model depends on your personal interests and other factors.",
      "The factors you need to be mindful of while selecting your laptop are its relevance to your student life, the mobility of the laptop and the budget you have allocated, if you are buying a new laptop. It is suggested that you have 4 to 8 GB RAM and a minimum of 256 GB Memory in  your laptop, as of January 2021. The laptop brand/model depends on your personal interests and other factors."],
     "context":[""]},

    {"tag":"InternetConnectivity",
     "patterns":["internet at iit mandi","connectivity at iit mandi","network connectivity at iit mandi","is the network at iit mandi strong",
      "connectivity issues","is the internet connectivity at iit mandi strong"],
     "responses":["Yes, IIT Mandi provides high speed internet. There is no cap on usage either.",
          "High speed internet connectivity is provided at IIT Mandi. Also note that it is unlimited."],
     "context":[""]},
    
    {"tag":"Books",
     "patterns":["books availability at library","should I buy books","can i get books at iit mandi's library","what books should i buy"],
     "responses":["Although the copies of required books are limited in the library, you can always get the books in e-book format. The local book stores at IIT Mandi and also online stores can also help you get some books and the seniors can also lend/provide to you second hand copies.",
     "The books specified by your teacher can be obtained in the Library. However, because it has limited copies, you may obtain the e-book version of these books. The local stores at IIT Mandi, your seniors and online stores can also provide you with the books you need."],
     "context":[""]},
    
    {"tag":"HolidaySchedule",
     "patterns":["holiday schedule","semester schedule", "do students get holidays",
         "schedule of holidays", "semester breaks"],
     "responses":["IIT Mandi has a generous holiday schedule. There are five working days every week, Monday to Friday. The weekends are holidays. Moreover, semester breaks are given from mid-June to early August and Winter break is from December to mid-February. However, the schedule of online semester is a little different. Check it out here: http://iitmandi.ac.in/academics/calendar.php",
         "Generous amount of hjolidays are given at IIT Mandi. In a week, Monday to Friday are working days and the weekends are holidays. In addition to this we have holidays for special occasions too. Semester breaks are given from mid-June to early August and from December to mid-February. The online semester has been subject to changes. Keep up with it here: http://iitmandi.ac.in/academics/calendar.php",
         "IIT Mandi has a fair holiday schedule. We have five working days per wekk, from Monday to Friday and the weekends are holidays. We also have holidays for special occasions and festivals. Semester breaks are given from mid-June to early August and from December to mid-February. The online semester has had a lot of chnages. Keep up with the oline schedule by following this link: http://iitmandi.ac.in/academics/calendar.php"],
     "context":[""]},    
    
    {"tag":"DelhiOrChandigarhToMandi",
     "patterns":["routes to follow from Delhi to Mandi","routes to follow from Chandigarh to Mandi",
         "reach Mandi from Delhi","reach Mandi from Chandigarh","routes from Delhi to Mandi","routes from Chnadigarh to Mandi"],
     "responses":["Mandi is easily accessible from the two places by bus or by cab. From Delhi ISBT(Kashmiri gate) there is a regular bus service: Volvo, Tata AC and ordinary buses go directly to Mandi. Same is the case for Chandigarh; besides, all buses from Delhi pass through Chandigarh. You can also take the train to Chandigarh, and from there from the ISBT at Sector 43 to Mandi by bus. At Mandi ISBT, you are right in front of our Transit Campus. From there take the Institute shuttle service to Kamand campus.",
      "Mandi can be accessed from either place by bus or by cab. There are regular buses (Volvo, Tata AC and ordinary buses) plying directly between Mandi and Delhi ISBT. All these buses also pass through Chandigarh. You can also take the train to Chandigarh and then from the ISBT at Sector 43, you can reach Mandi by bus. Once you reach Mandi ISBT, you can take the Institute Shuttle Service to Kamand Campus.",
      "Mandi can be reached from both places by bus or by cab. There are regular buses (Volvo, Tata AC and ordinary buses) going between Mandi and Delhi ISBT, which also pass through Chnadigarh on the way. There is also a train to Chandigarh. From the ISBT at Sector 43, you can reach Mandi ISBT by bus, the Institute Shuttle service will ensure you reach the Kamand Campus."],
     "context":[""]},    
    
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},    
    
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},
        
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},
        
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},    
        
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},    
        
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},    
            
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},
        
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},
       
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},    
        
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},    
        
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},    
       
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},
            
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},
            
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},    
           
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]},    
            
    {"tag":"",
     "patterns":[""],
     "responses":[""],
     "context":[""]}

  ]


  
}





